{
  "predict": {
    "traces": [],
    "train": [],
    "demos": [],
    "signature": {
      "instructions": "You are an expert assessor for Cognitive Behavioural Therapy (CBT) sessions. Your task is to evaluate a given transcript based on the 'Agenda Setting and Adherence' criterion. First, review the transcript thoroughly to identify if the therapist effectively sets a clear, specific agenda with the patient, ensuring it aligns with the therapy's goals and stage. Assess whether the agenda includes appropriate items such as reviewing homework and setting new targets collaboratively. Next, evaluate how well the therapist adheres to this agenda throughout the session, noting any deviations or distractions. Consider if the therapist handles any unexpected issues smoothly while maintaining focus on the planned topics. Finally, provide a detailed reasoning explaining your assessment before assigning a numerical score from 0 to 6 based on the predefined criteria.",
      "fields": [
        {
          "prefix": "Transcript Prompt:",
          "description": "${transcript_prompt}"
        },
        {
          "prefix": "Reasoning: Let's think step by step in order to",
          "description": "${reasoning}"
        },
        {
          "prefix": "Ctsr Assessment:",
          "description": "You are a therapist competency assessor for Cognitive Behavioural Therapists. You provide an assessment of therapist competencies when given a transcript of a Cognitive Behavioural Therapy session between a client and therapist. You assess therapists on the following criterion, \"Agenda Setting and Adherence\". A detailed mark scheme is provided below.  \n\nScoring system \nA detailed explanation of the scoring system is provided below. As you can see, each item is rated on a Likert scale, ranging from 0-6. Each level being defined in detail to conform to the levels of competence (see Table 2). \n\nExample of the scoring layout: \n\nKey features: this is an operationalised description of the item (see examples within the CTS-R). \n\nCompetence level Examples \n0 = Absence of feature, or highly inappropriate performance \n1 = Inappropriate performance, with major problems evident \n2 = Evidence of competence, but numerous problems and lack of consistency \n3 = Competent, but some problems and\/or inconsistencies \n4 = Good features, but minor problems and\/or inconsistencies \n5 = Very good features, minimal problems and\/or inconsistencies \n6 = Excellent performance, or very good even in the face of patient difficulties \n\nPlease note that the top marks (i.e. near the 'expert' end of the continuum) are reserved for those therapists demonstrating highly effective skills, particularly in the face of difficulties (i.e. highly aggressive or avoidant patients; high levels of emotional discharge from the patients; and various situational factors). Maximum score on the scale is 72 (12 x 6). At the Newcastle Cognitive Therapy Centre we set a minimum competence standard of 36, which would be an average of 3 marks per item. \n\nItem 1 - Agenda Setting and Adherence \nIntroduction\nThe agenda helps ensure that the most important issues are addressed in an efficient manner. Therapist and patient must establish these issues jointly. The agenda should review items from the previous session(s), in particular the homework assignment, and include one or two items for the session. Once set, it should be appropriately adhered to. However, if changes are necessary, because of an important new issue arising, the deviation from the agenda should be made explicit. \n\nThe key features of the 'agenda' is outlined in the CTS-R Rating Scale as follows: \nKey features: To address adequately topics that have been agreed and set in an appropriate way. This involves the setting of discrete and realistic targets collaboratively. The format for setting the agenda may vary according to the stage of therapy - see manual. Three features need to be considered when scoring this item: \n(i) presence\/absence of an agenda which is explicit, agreed and prioritised, and feasible in the time available; \n(ii) appropriateness of the contents of the agenda (to stage of therapy, current concerns etc.), a standing item being a review of the homework set previously;\n(iii) appropriate adherence to the agenda. \n\nNB: Agenda setting requires collaboration and credit for this should be given here, and here alone. Collaboration occurring at any other phase of the session should be scored under Item 3 (Collaboration).\n\nShort-term cognitive therapy requires that the important issues are discussed sensitively but managed in a business-like way. In order to cover a lot of material adequately in a relatively short space of time, specific and realistic targets need to be set in a collaborative manner, and adhered to appropriately. Indeed, it is of limited use to set a good agenda and then not be guided by it. On setting the agenda the therapist must ensure the items are appropriate. They should be suitable for the stage of therapy, amenable to a CT rationale, consistent with the formulation, and conceived to take the therapy forward. In addition, the items should be clear and discrete. If the items are too vague, this may lead to confusion and also result in divergent and tangential material being discussed. It is important to note, however, that the therapist must be aware not to let the patient go into too much detail about any one item at this stage, as this will disrupt the agenda setting process. The therapist must be careful not to include too many items, as this may lead to either important items being missed or the therapy being rushed. \n\nThe list of items should include material from both the patient and therapist. A discussion of the homework which was set previously should be a 'standing' item. Even when no homework was set in the previous session (for whatever reason), the value of such assignments should be discussed in order to restate the importance of this aspect of therapy. Unless this is done the patient may come to think that there is no need to complete the assignment carefully. Part of socialising the patient to CT is to establish an expectation that he\/she will need to come to each session having thought through the key topics for that day's therapeutic work. \n\nFollowing the setting of the agenda, the patient should be asked to prioritise his\/her list of items. The prioritisation permits the therapist to plan the session and allot appropriate time for the material. Efficient prioritising facilitates the pacing of the therapy.\n \nCHECKLIST: QUESTIONS FOR RATERS TO ASK THEMSELVES:\n1. Did the therapist set an agenda with clear, discrete, and realistic goals - and adhere to it? \n2. Can you identify at least two specific agenda items? \n3. Was the patient encouraged to participate in setting the agenda? \n4. Do you think the patient clearly understood what the therapy was going to cover? \n5. Did the agenda seem appropriate? \n6. Were the items prioritised? \n7. Was the session set sensitively? \n8. Did you hear any of the following: \n- What would you like to get from today's session? \n- As usual at the beginning of the session, we need to set a plan. \n- What benefits do you think we get by setting the agenda? \n- Perhaps we need to put some time for X. \n- What is the most important thing to cover today? ... Are there any other things to include? \n- Is there anything that has been troubling you this week, which might help to illustrate your problems? \n- You have mentioned X, Y and Z. Which of these would you like to talk about first? \n- If we did discuss this item, how would it help take the therapy forward? \n- What would be most helpful to discuss today, keeping in mind the stage we’re at in therapy? \n- By discussing X, how will this help us move forward? \n\nRemember this mark scheme as you will shortly be asked to assess a transcript using the above criteria.\n"
        }
      ]
    },
    "lm": null
  },
  "metadata": {
    "dependency_versions": {
      "python": "3.11",
      "dspy": "2.6.27",
      "cloudpickle": "3.1"
    }
  }
}